# Joining Data
in many cases you have multiple data sets you would like to join. Among the scenarios you will encounter this are:
1. multiple sources of data regarding your data points e.g., you start an ad campaign for which you have internal parameters (cost, targeted audience, etc.,) and external results (response rate, convergence rate, etc.,)
2. a dataset + other datasets describing features e.g., movie dataset (name, genre, budget, director, etc.) + genre dataset (per genre risk, attendance, rewatchability, etc.) 

Let's get busy. 

## More data
The easiest case is when you add rows to your table (dataframe) from another table (dataframe). To show this we first create a simple data frame

In [4]:
# run forest run
import pandas as pd
import numpy as np

def create_simple_df(columns='ABCD', rows=['I','II','III','IV']):
    if isinstance(columns, str):
        columns = list(columns)
    data = np.empty((len(rows), len(columns)), dtype=object)
    for i, r in enumerate(rows):
        for j, c in enumerate(columns):
            data[i][j] = c+r
            
    return pd.DataFrame(data, columns=columns, index=rows)

# creating a simple dataframe
simple_df = create_simple_df()
simple_df

        A     B     C     D
I      AI    BI    CI    DI
II    AII   BII   CII   DII
III  AIII  BIII  CIII  DIII
IV    AIV   BIV   CIV   DIV

Now you. 
1. create a dataframe from rows 0 and 3 of `simple_df`, we'll call it `simple_df_1`
2. create a dataframe from rows 2 and 1 of `simple_df`, we'll call it `simple_df_2`
3. concatenate the dataframes using `pd.concat`
4. concatenate the dataframes using `simple_df_1.append`

In [5]:
simple_df_1 = pd.DataFrame(simple_df, columns=['A','B','C','D'], index=['I','IV'])
print(simple_df_1)

simple_df_2 = pd.DataFrame(simple_df, columns=['A','B','C','D'], index=['III','II'])
print(simple_df_2)

print(pd.concat([simple_df_1, simple_df_2]))
print(simple_df_1.append(simple_df_2))

      A    B    C    D
I    AI   BI   CI   DI
IV  AIV  BIV  CIV  DIV
        A     B     C     D
III  AIII  BIII  CIII  DIII
II    AII   BII   CII   DII
        A     B     C     D
I      AI    BI    CI    DI
IV    AIV   BIV   CIV   DIV
III  AIII  BIII  CIII  DIII
II    AII   BII   CII   DII
        A     B     C     D
I      AI    BI    CI    DI
IV    AIV   BIV   CIV   DIV
III  AIII  BIII  CIII  DIII
II    AII   BII   CII   DII

Sometimes life is not that easy and not all the columns match.
1. create a dataframe from rows 0 and 3 and columns 0, 1, 2 of `simple_df`, we'll call it `simple_df_3`
2. create a dataframe from rows 2 and 1 and columns 1, 2, 3 of `simple_df`, we'll call it `simple_df_4`
3. concatenate the dataframes using `pd.concat`
4. concatenate the dataframes using `simple_df_3.append`

In [6]:
simple_df_3 = pd.DataFrame(simple_df, columns=['A','B','C'], index=['I','IV'])
print(simple_df_3)

simple_df_4 = pd.DataFrame(simple_df, columns=['B','C','D'], index=['III','II'])
print(simple_df_4)

print(pd.concat([simple_df_3, simple_df_4]))
print(simple_df_3.append(simple_df_4))

      A    B    C
I    AI   BI   CI
IV  AIV  BIV  CIV
        B     C     D
III  BIII  CIII  DIII
II    BII   CII   DII
       A     B     C     D
I     AI    BI    CI   NaN
IV   AIV   BIV   CIV   NaN
III  NaN  BIII  CIII  DIII
II   NaN   BII   CII   DII
       A     B     C     D
I     AI    BI    CI   NaN
IV   AIV   BIV   CIV   NaN
III  NaN  BIII  CIII  DIII
II   NaN   BII   CII   DII

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:7: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  import sys
/usr/local/lib/python3.7/site-packages/pandas/core/frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

Pandas is trying, it really is, but you're not making its life easy. With no other option it replaces missing values with NaN. To change `concat` behavior regarding missing values you can give `join` as a keyword argument to `concat`. Repeat the concatenation with `join` set to
1. inner
2. outer

Instead of setting `join` you can decide your only interested in a specific set of columns using the `join_axes` keyword argument to `concat`. Repeat the concatenation with `join_axes` set to `simple_df_4.columns`

In [7]:
print(pd.concat([simple_df_3, simple_df_4], join='inner', sort=True))
print(pd.concat([simple_df_3, simple_df_4], join='outer', sort=True))
print(pd.concat([simple_df_3, simple_df_4], join_axes=[simple_df_4.columns], sort=True))

        B     C
I      BI    CI
IV    BIV   CIV
III  BIII  CIII
II    BII   CII
       A     B     C     D
I     AI    BI    CI   NaN
IV   AIV   BIV   CIV   NaN
III  NaN  BIII  CIII  DIII
II   NaN   BII   CII   DII
        B     C     D
I      BI    CI   NaN
IV    BIV   CIV   NaN
III  BIII  CIII  DIII
II    BII   CII   DII

explain in your words what is the difference between the methods

*your words here*
...

## Enriching data
things get more interesting when we want to enrich each data point (row) with more information. 
Use `pd.read_csv` to read the following files
1. restaurants_details.csv
2. restaurants_aux.csv

to make sure your data import succeeded print out the head (first few rows) for each dataframe. **YOU SHOULD ALWAYS DO THIS** when importing data as a sanity check

In [8]:
det = pd.read_csv('restaurants_details.csv')
aux = pd.read_csv('restaurants_aux.csv')
print(det.head())
print(aux.head())

          Restaurant     address     opens_at    closes_at
0      humus_hakerem   Shoken 30  08:00:00 AM  07:00:00 PM
1         al_harampa  Ha'amal 21  11:00:00 AM  03:00:00 AM
2  twenty_four_rupee   Shoken 16  10:00:00 AM  12:00:00 PM
3         pizza_much   Shoken 24  11:00:00 AM          NaN
4       falafel_gina   Shoken 22  09:00:00 AM  09:00:00 PM
          Restaurant     address     type  moogle_rating
0      humus_hakerem   Shoken 30    humus            4.1
1         al_harampa  Ha'amal 21      pub            4.3
2  twenty_four_rupee   Shoken 16   indian            4.3
3         pizza_much   Shoken 24    pizza            NaN
4       falafel_gina   Shoken 22  falafel            4.0

Use `pd.merge` to merge columns of both dataframes and print the result. You can explicitly state on which columns you want to merge using the `on` keyword to merge.

In [9]:
det_aux = pd.merge(det,aux)
print(det_aux)

           Restaurant           address     opens_at    closes_at       type  \
0       humus_hakerem         Shoken 30  08:00:00 AM  07:00:00 PM      humus
1          al_harampa        Ha'amal 21  11:00:00 AM  03:00:00 AM        pub
2   twenty_four_rupee         Shoken 16  10:00:00 AM  12:00:00 PM     indian
3          pizza_much         Shoken 24  11:00:00 AM          NaN      pizza
4        falafel_gina         Shoken 22  09:00:00 AM  09:00:00 PM    falafel
5               aroma        everywhere  08:00:00 AM  10:00:00 PM       cafe
6               cofix        everywhere  08:00:00 AM  10:00:00 PM       cafe
7             vitosha  yehuda hayamit 3  10:00:00 AM  10:30:00 PM  bulgarian
8               bugsy    shalma road 44          NaN  02:00:00 AM        pub
9     vicky_christina  mitham_hatachana          NaN  02:00:00 AM    spanish
10            shtern1  avraham shtern 1          NaN          NaN        pub

    moogle_rating
0             4.1
1             4.3
2             4.3
3             NaN
4             4.0
5             3.5
6             3.3
7             4.0
8             4.2
9             4.2
10            NaN

Sometimes you may want want to join on a column which has a different name in each dataset (table). You can use the `left_on`, `right_on` to specify how the columns to join on is named in both tables.

1. Use `pd.read_csv` to read restaurants_data_from_friends.csv
2. print out the **entire** dataframe
3. us `pd.merge` with the aforementioned keywords to merge this data to our previous data

In [10]:
friends = pd.read_csv('restaurants_data_from_friends.csv')
print(friends)
det_aux_friends = pd.merge(det_aux, friends, left_on='Restaurant', right_on='Name')
print(det_aux_friends)

                 Name  num_of_friends_who_likes  cheapest_lunch
0       humus_hakerem                         5              30
1          al_harampa                         2              50
2   twenty_four_rupee                         3              40
3          pizza_much                         0              18
4        falafel_gina                         4              25
5               aroma                         1              35
6               cofix                         2              10
7             vitosha                         4              60
8               bugsy                         3              55
9     vicky_christina                         5              53
10              taizu                         1             100
          Restaurant           address     opens_at    closes_at       type  \
0      humus_hakerem         Shoken 30  08:00:00 AM  07:00:00 PM      humus
1         al_harampa        Ha'amal 21  11:00:00 AM  03:00:00 AM        pub
2  twenty_four_rupee         Shoken 16  10:00:00 AM  12:00:00 PM     indian
3         pizza_much         Shoken 24  11:00:00 AM          NaN      pizza
4       falafel_gina         Shoken 22  09:00:00 AM  09:00:00 PM    falafel
5              aroma        everywhere  08:00:00 AM  10:00:00 PM       cafe
6              cofix        everywhere  08:00:00 AM  10:00:00 PM       cafe
7            vitosha  yehuda hayamit 3  10:00:00 AM  10:30:00 PM  bulgarian
8              bugsy    shalma road 44          NaN  02:00:00 AM        pub
9    vicky_christina  mitham_hatachana          NaN  02:00:00 AM    spanish

   moogle_rating               Name  num_of_friends_who_likes  cheapest_lunch
0            4.1      humus_hakerem                         5              30
1            4.3         al_harampa                         2              50
2            4.3  twenty_four_rupee                         3              40
3            NaN         pizza_much                         0              18
4            4.0       falafel_gina                         4              25
5            3.5              aroma                         1              35
6            3.3              cofix                         2              10
7            4.0            vitosha                         4              60
8            4.2              bugsy                         3              55
9            4.2    vicky_christina                         5              53

this works but we still have the duplicate columns which can be dropped using `<dataframe>.drop`. Try it now

In [11]:
det_aux_friends.drop(columns=['Restaurant'])

,address,opens_at,closes_at,type,moogle_rating,Name,num_of_friends_who_likes,cheapest_lunch
0,Shoken 30,08:00:00 AM,07:00:00 PM,humus,4.1,humus_hakerem,5,30
1,Ha'amal 21,11:00:00 AM,03:00:00 AM,pub,4.3,al_harampa,2,50
2,Shoken 16,10:00:00 AM,12:00:00 PM,indian,4.3,twenty_four_rupee,3,40
3,Shoken 24,11:00:00 AM,NaN,pizza,NaN,pizza_much,0,18
4,Shoken 22,09:00:00 AM,09:00:00 PM,falafel,4.0,falafel_gina,4,25
5,everywhere,08:00:00 AM,10:00:00 PM,cafe,3.5,aroma,1,35
6,everywhere,08:00:00 AM,10:00:00 PM,cafe,3.3,cofix,2,10
7,yehuda hayamit 3,10:00:00 AM,10:30:00 PM,bulgarian,4.0,vitosha,4,60
8,shalma road 44,NaN,02:00:00 AM,pub,4.2,bugsy,3,55
9,mitham_hatachana,NaN,02:00:00 AM,spanish,4.2,vicky_christina,5,53

### missing values
much like `pd.concat` you can tell pandas what to do regarding missing values using the `how` keyword argument. Aside from `inner` and `outer` you've already seen, you can use `left` or `right` to tell pandas only to keep rows availabe in the left or right dataframe respectively. 
1. merge using `inner` to keep rows that exist in both dataframes
2. merge using `outer` to keep rows that exist in at least one dataframe
3. print rows in the outer merge that do not appear in the inner one
3. merge using `left` to keep rows that exist in the left dataframe
4. merge using `right` to keep rows that exist in the right dataframe

In [12]:
inner_merge = pd.merge(det_aux, friends, left_on='Restaurant', right_on='Name', how='inner')
outer_merge = pd.merge(det_aux, friends, left_on='Restaurant', right_on='Name', how='outer')
outer_inner_merge = pd.merge(outer_merge, inner_merge, left_on='Name', right_on='Name', how='left')
left_merge = pd.merge(det_aux, friends, left_on='Restaurant', right_on='Name', how='left')
right_merge = pd.merge(det_aux, friends, left_on='Restaurant', right_on='Name', how='right')
print(inner_merge)
print(outer_merge)
print(left_merge)
print(right_merge)

          Restaurant           address     opens_at    closes_at       type  \
0      humus_hakerem         Shoken 30  08:00:00 AM  07:00:00 PM      humus
1         al_harampa        Ha'amal 21  11:00:00 AM  03:00:00 AM        pub
2  twenty_four_rupee         Shoken 16  10:00:00 AM  12:00:00 PM     indian
3         pizza_much         Shoken 24  11:00:00 AM          NaN      pizza
4       falafel_gina         Shoken 22  09:00:00 AM  09:00:00 PM    falafel
5              aroma        everywhere  08:00:00 AM  10:00:00 PM       cafe
6              cofix        everywhere  08:00:00 AM  10:00:00 PM       cafe
7            vitosha  yehuda hayamit 3  10:00:00 AM  10:30:00 PM  bulgarian
8              bugsy    shalma road 44          NaN  02:00:00 AM        pub
9    vicky_christina  mitham_hatachana          NaN  02:00:00 AM    spanish

   moogle_rating               Name  num_of_friends_who_likes  cheapest_lunch
0            4.1      humus_hakerem                         5              30
1            4.3         al_harampa                         2              50
2            4.3  twenty_four_rupee                         3              40
3            NaN         pizza_much                         0              18
4            4.0       falafel_gina                         4              25
5            3.5              aroma                         1              35
6            3.3              cofix                         2              10
7            4.0            vitosha                         4              60
8            4.2              bugsy                         3              55
9            4.2    vicky_christina                         5              53
           Restaurant           address     opens_at    closes_at       type  \
0       humus_hakerem         Shoken 30  08:00:00 AM  07:00:00 PM      humus
1          al_harampa        Ha'amal 21  11:00:00 AM  03:00:00 AM        pub
2   twenty_four_rupee         Shoken 16  10:00:00 AM  12:00:00 PM     indian
3          pizza_much         Shoken 24  11:00:00 AM          NaN      pizza
4        falafel_gina         Shoken 22  09:00:00 AM  09:00:00 PM    falafel
5               aroma        everywhere  08:00:00 AM  10:00:00 PM       cafe
6               cofix        everywhere  08:00:00 AM  10:00:00 PM       cafe
7             vitosha  yehuda hayamit 3  10:00:00 AM  10:30:00 PM  bulgarian
8               bugsy    shalma road 44          NaN  02:00:00 AM        pub
9     vicky_christina  mitham_hatachana          NaN  02:00:00 AM    spanish
10            shtern1  avraham shtern 1          NaN          NaN        pub
11                NaN               NaN          NaN          NaN        NaN

    moogle_rating               Name  num_of_friends_who_likes  cheapest_lunch
0             4.1      humus_hakerem                       5.0            30.0
1             4.3         al_harampa                       2.0            50.0
2             4.3  twenty_four_rupee                       3.0            40.0
3             NaN         pizza_much                       0.0            18.0
4             4.0       falafel_gina                       4.0            25.0
5             3.5              aroma                       1.0            35.0
6             3.3              cofix                       2.0            10.0
7             4.0            vitosha                       4.0            60.0
8             4.2              bugsy                       3.0            55.0
9             4.2    vicky_christina                       5.0            53.0
10            NaN                NaN                       NaN             NaN
11            NaN              taizu                       1.0           100.0
           Restaurant           address     opens_at    closes_at       type  \
0       humus_hakerem         Shoken 30  08:00:00 AM  07:00:00 PM      humus
1          al_harampa        Ha'amal 21  11:00:00 AM  03:00:00 AM        pub
2   twenty_four_rupee         Shoken 16  10:00:00 AM  12:00:00 PM     indian
3          pizza_much         Shoken 24  11:00:00 AM          NaN      pizza
4        falafel_gina         Shoken 22  09:00:00 AM  09:00:00 PM    falafel
5               aroma        everywhere  08:00:00 AM  10:00:00 PM       cafe
6               cofix        everywhere  08:00:00 AM  10:00:00 PM       cafe
7             vitosha  yehuda hayamit 3  10:00:00 AM  10:30:00 PM  bulgarian
8               bugsy    shalma road 44          NaN  02:00:00 AM        pub
9     vicky_christina  mitham_hatachana          NaN  02:00:00 AM    spanish
10            shtern1  avraham shtern 1          NaN          NaN        pub

    moogle_rating               Name  num_of_friends_who_likes  cheapest_lunch
0             4.1      humus_hakerem                       5.0            30.0
1             4.3         al_harampa                       2.0            50.0
2             4.3  twenty_four_rupee                       3.0            40.0
3             NaN         pizza_much                       0.0            18.0
4             4.0       falafel_gina                       4.0            25.0
5             3.5              aroma                       1.0            35.0
6             3.3              cofix                       2.0            10.0
7             4.0            vitosha                       4.0            60.0
8             4.2              bugsy                       3.0            55.0
9             4.2    vicky_christina                       5.0            53.0
10            NaN                NaN                       NaN             NaN
           Restaurant           address     opens_at    closes_at       type  \
0       humus_hakerem         Shoken 30  08:00:00 AM  07:00:00 PM      humus
1          al_harampa        Ha'amal 21  11:00:00 AM  03:00:00 AM        pub
2   twenty_four_rupee         Shoken 16  10:00:00 AM  12:00:00 PM     indian
3          pizza_much         Shoken 24  11:00:00 AM          NaN      pizza
4        falafel_gina         Shoken 22  09:00:00 AM  09:00:00 PM    falafel
5               aroma        everywhere  08:00:00 AM  10:00:00 PM       cafe
6               cofix        everywhere  08:00:00 AM  10:00:00 PM       cafe
7             vitosha  yehuda hayamit 3  10:00:00 AM  10:30:00 PM  bulgarian
8               bugsy    shalma road 44          NaN  02:00:00 AM        pub
9     vicky_christina  mitham_hatachana          NaN  02:00:00 AM    spanish
10                NaN               NaN          NaN          NaN        NaN

    moogle_rating               Name  num_of_friends_who_likes  cheapest_lunch
0             4.1      humus_hakerem                         5              30
1             4.3         al_harampa                         2              50
2             4.3  twenty_four_rupee                         3              40
3             NaN         pizza_much                         0              18
4             4.0       falafel_gina                         4              25
5             3.5              aroma                         1              35
6             3.3              cofix                         2              10
7             4.0            vitosha                         4              60
8             4.2              bugsy                         3              55
9             4.2    vicky_christina                         5              53
10            NaN              taizu                         1             100

## enriching via features
sometime you may have data relating to you features that may be useful. 
1. load restaurants_types_data.csv
2. print the dataframe
3. merge with out previous data

In [70]:
types = pd.read_csv('restaurants_type_data.csv')
print(types)
pd.merge(det_aux, types, how='inner')

      type  sleepy
0    humus       5
1  falafel       4
2     cafe       2
3      pub       3

,Restaurant,address,opens_at,closes_at,type,moogle_rating,sleepy
0,humus_hakerem,Shoken 30,08:00:00 AM,07:00:00 PM,humus,4.1,5
1,al_harampa,Ha'amal 21,11:00:00 AM,03:00:00 AM,pub,4.3,3
2,bugsy,shalma road 44,NaN,02:00:00 AM,pub,4.2,3
3,shtern1,avraham shtern 1,NaN,NaN,pub,NaN,3
4,falafel_gina,Shoken 22,09:00:00 AM,09:00:00 PM,falafel,4.0,4
5,aroma,everywhere,08:00:00 AM,10:00:00 PM,cafe,3.5,2
6,cofix,everywhere,08:00:00 AM,10:00:00 PM,cafe,3.3,2